'use strict';

// Прийом 'Модуль' використовується для приховання внутрішніх деталей (інкапсуляції) функцій/класів

// Переваги
// 1. Модулі виносяться в окремі файли і вони не залежні від іншого коду.
// 2. Забезпечують чистоту глобального простору.
// Коли ми пишемо скріпт і створюємо змінні - вони заносяться в глобальну область видимості.
// Робити так не рекомендується. Глобальних змінних має бути як можна менше.
// Тож модулі допомагають уникнути забруднення глобального простору.
// І також допомагають уникнути конфліктних ситуацій з однаковими іменами змінних, тому що всі дані модуля існують в його особістій області видимості

// Способи створення модулів:
// 1. Анонімна функція з самовикликом:

const number = 1;

(function(){
    let number = 2;
    console.log(number); // 2
    console.log(number + 3); // 5
}());

console.log(number); // 1


// 2. Використання об'єктного інтерфейсу

const user = (function() {
    const privat = function() {
        console.log('I am privat!');
    };

    return {
        sayHello: privat
    };
}());

user.sayHello(); // 'I am privat!'