'use strict';

// new RegExp('pattern', 'flags');
// /pattern/f

// Пошук потрібного символу

// const ans = prompt('Type your name');

const reg = /n/ig; // це паттерн пошуку букви 'n' в якомусь рядку. Все, що йде після /n/ - флажки

// 'i' - флажок пошуку не залежно від регистру (велика чи мала буква)
// 'g' - global - якщо ми намагаємось знайти відразу кілька входжень
// 'm' - багаторядковий режим

// console.log(ans.search(reg));
// console.log(ans.match(reg));

// ================================================================================================

// Заміна символів

// const pass = prompt('Password');
// console.log(pass.replace(/./g, '*')); // '.' - крапка означає абсолютно всі елементи, які потраплять в рядок

// console.log('12-34-56'.replace(/-/g, ':'));

// ================================================================================================

// МЕТОД test() у регулярного виразу повертає true або false

// const ans2 = prompt('Type your name');

// const reg2 = /n/ig;
// console.log(reg2.test(ans2));

// ================================================================================================

// КЛАСИ В РЕГУЛЯРНИХ ВИРАЗАХ (коли ми шукаємо не окремі символи, а класи символів (цифри, букви, пробіли і т.д.))

// 1. '\d' - digits - шукаємо цифри
// 2. '\w' - words - шукаємо букви
// 3. '\s' - spaces - шукаємо пробіли

// const ans3 = prompt('Type your number');

// const reg3 = /\d/;
// console.log(ans3.match(reg3));

// ================================================================================================

const str = 'My name is R2D2';

console.log(str.match(/\w\d\w\d/i));

// ================================================================================================

// Також існують зворотні класи (позначаються буквами в верхньому регістрі):
// '\D' - не цифри
// '\W' - не букви
// '\S' - не пробіли